arduino/arduino-cli/internal/integrationtest/debug/testdata/hardware/my/samd/boards.txt
my.name=My Cool Board
my.vid.0=0x2341
my.pid.0=0x804e
my.upload_port.0.vid=0x2341
my.upload_port.0.pid=0x804e
my.upload.tool=bossac
my.upload.tool.default=bossac
my.upload.tool.network=arduino_ota
my.upload.protocol=sam-ba
my.upload.maximum_size=262144
my.upload.maximum_data_size=32768
my.upload.use_1200bps_touch=true
my.upload.wait_for_upload_port=true
my.upload.native_usb=true
my.build.mcu=cortex-m0plus
my.build.f_cpu=48000000L
my.build.usb_product="Arduino MKR1000"
my.build.usb_manufacturer="Arduino LLC"
my.build.board=SAMD_MY
my.build.core=arduino:arduino
my.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags}
my.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
my.build.openocdscript=openocd_scripts/arduino_zero.cfg
my.build.variant=arduino:mkr1000
my.build.vid=0x2341
my.build.pid=0x804e

my.debug.toolchain.path=gcc-path
my.debug.toolchain.prefix=gcc-prefix
my.debug.server.openocd.path=openocd-path
my.debug.server.openocd.scripts_dir=openocd-scripts-dir
my.debug.server.openocd.script=
my.debug.server.openocd.scripts.0=first
my.debug.server.openocd.scripts.1=second
my.debug.server.openocd.scripts.2=third
